[
    {
        "id": 1,
        "title": "Inception",
        "year": 2010,
        "director": "Christopher Nolan",
        "genre": "Ciencia ficción, Acción",
        "synopsis": "Dom Cobb es un ladrón con la rara habilidad de entrar en los sueños de las personas y robarles sus secretos. Sin embargo, cuando le ofrecen borrar su pasado criminal, deberá lograr lo contrario: implantar una idea en la mente de una persona."
    },
    {
        "id": 2,
        "title": "The Shawshank Redemption",
        "year": 1994,
        "director": "Frank Darabont",
        "genre": "Drama",
        "synopsis": "Andy Dufresne, un banquero condenado por el asesinato de su esposa y su amante, forja una profunda amistad con Red, un preso veterano. A lo largo de los años, su optimismo e ingenio le ayudan a soportar la dura vida en prisión."
    },
    {
        "id": 3,
        "title": "Pulp Fiction",
        "year": 1994,
        "director": "Quentin Tarantino",
        "genre": "Crimen, Drama",
        "synopsis": "La película entrelaza varias historias de personajes en Los Ángeles, incluyendo la de dos sicarios, un boxeador y la esposa de un mafioso, en una narración no lineal que se convirtió en un icono del cine de los 90."
    },
    {
        "id": 4,
        "title": "El Laberinto del Fauno",
        "year": 2006,
        "director": "Guillermo del Toro",
        "genre": "Fantasía, Drama",
        "synopsis": "En la España franquista de 1944, una joven llamada Ofelia descubre un mundo subterráneo y fantástico donde se encuentra con criaturas misteriosas mientras lucha por sobrevivir en un mundo lleno de crueldad."
    },
    {
        "id": 5,
        "title": "The Matrix",
        "year": 1999,
        "director": "Lana y Lilly Wachowski",
        "genre": "Ciencia ficción, Acción",
        "synopsis": "Neo, un hacker, descubre que el mundo que conoce es una simulación creada por máquinas para mantener a la humanidad bajo control. Con la ayuda de un grupo de rebeldes, luchará por liberar a la humanidad."
    }
]
